NguyenHoangTrieu/STM32N6-GettingStarted-FaceDetection-main/STM32N6-GettingStarted-FaceDetection-main/Application/STM32N6570-DK/Src/main.c
  if (HAL_GetTick() - t0 < 4000)
  {
    /* Draw logo */
    UTIL_LCD_FillRGBRect(280, 180, (uint8_t *) maxresdefault, 240, 120);

    /* Display welcome message */
    UTIL_LCD_SetBackColor(0x40000000);
    UTIL_LCDEx_PrintfAt(0, LINE(16), CENTER_MODE, "Face Detection");
    UTIL_LCDEx_PrintfAt(0, LINE(17), CENTER_MODE, WELCOME_MSG_1);
    UTIL_LCDEx_PrintfAt(0, LINE(18), CENTER_MODE, WELCOME_MSG_2);
    UTIL_LCD_SetBackColor(0);
  }
}

/**
 * @brief Log neural network detection results over UART
 *
 * Logs every frame (compact line) plus detailed bounding-box / keypoint info
 * whenever a face is detected.  Prints FPS / inference statistics every 100
 * frames so the serial monitor stays readable without being flooded.
 */
static void Log_NetworkOutput(fd_pp_out_t *p_postprocess, uint32_t inference_ms)
{
  static uint32_t frame_cnt  = 0;
  static uint32_t t_start    = 0;
  static uint32_t inf_total  = 0;
  static uint32_t inf_min    = UINT32_MAX;
  static uint32_t inf_max    = 0;
  static int32_t  last_nb    = -1;

#if POSTPROCESS_TYPE == POSTPROCESS_FD_BLAZEFACE_UI
  static const char * const kpt_names[AI_FD_BLAZEFACE_PP_NB_KEYPOINTS] = {
    "L-eye", "R-eye", "nose ", "mouth", "L-ear", "R-ear"
  };
#endif

  int32_t nb = p_postprocess->nb_detect;

  if (t_start == 0)
    t_start = HAL_GetTick();
  frame_cnt++;

  /* Running inference stats */
  inf_total += inference_ms;
  if (inference_ms < inf_min) inf_min = inference_ms;
  if (inference_ms > inf_max) inf_max = inference_ms;

  /* --- Compact per-frame line ------------------------------------------- */
  printf("[%5lu] %3lums | %s | %ld face(s)\n",
         (unsigned long)frame_cnt,
         (unsigned long)inference_ms,
         nb > 0 ? "FACE  " : "------",
         (long)nb);

  /* --- Detailed face info (printed when result changes or face present) -- */
  if (nb > 0)
  {
    for (int i = 0; i < nb; i++)
    {
      fd_pp_outBuffer_t *f = &p_postprocess->pOutBuff[i];
      printf("  >> Face#%d  conf=%.2f  cx=%.3f cy=%.3f  w=%.3f h=%.3f\n",
             i,
             (double)f->conf,
             (double)f->x_center, (double)f->y_center,
             (double)f->width,    (double)f->height);
#if POSTPROCESS_TYPE == POSTPROCESS_FD_BLAZEFACE_UI
      printf("     kpts:");
      for (int k = 0; k < AI_FD_BLAZEFACE_PP_NB_KEYPOINTS; k++)
        printf("  %s(%.3f,%.3f)",
               kpt_names[k],
               (double)f->pKeyPoints[k].x,
               (double)f->pKeyPoints[k].y);
      printf("\n");
#endif
    }
  }
  else if (last_nb > 0)
  {
    printf("  >> No face\n");
  }
  last_nb = nb;

  /* --- Periodic stats every 100 frames ----------------------------------- */
  if (frame_cnt % 100 == 0)
  {
    uint32_t elapsed_ms = HAL_GetTick() - t_start;
    float    fps        = (elapsed_ms > 0) ? ((float)frame_cnt * 1000.0f / (float)elapsed_ms) : 0.0f;
    uint32_t avg_ms     = inf_total / frame_cnt;
    printf("[STAT] frames=%lu  fps=%.1f  inf avg=%lums  min=%lums  max=%lums\n",
           (unsigned long)frame_cnt,
           (double)fps,
           (unsigned long)avg_ms,
           (unsigned long)inf_min,
           (unsigned long)inf_max);
  }
}

/**
  * @brief  DCMIPP Clock Config for DCMIPP.
  * @param  hdcmipp  DCMIPP Handle
  *         Being __weak it can be overwritten by the application
  * @retval HAL_status
  */
HAL_StatusTypeDef MX_DCMIPP_ClockConfig(DCMIPP_HandleTypeDef *hdcmipp)
{
  RCC_PeriphCLKInitTypeDef RCC_PeriphCLKInitStruct = {0};
  HAL_StatusTypeDef ret = HAL_OK;

  RCC_PeriphCLKInitStruct.PeriphClockSelection = RCC_PERIPHCLK_DCMIPP;
  RCC_PeriphCLKInitStruct.DcmippClockSelection = RCC_DCMIPPCLKSOURCE_IC17;
  RCC_PeriphCLKInitStruct.ICSelection[RCC_IC17].ClockSelection = RCC_ICCLKSOURCE_PLL2;
  RCC_PeriphCLKInitStruct.ICSelection[RCC_IC17].ClockDivider = 3;
  ret = HAL_RCCEx_PeriphCLKConfig(&RCC_PeriphCLKInitStruct);
  if (ret)
  {
    return ret;
  }

  RCC_PeriphCLKInitStruct.PeriphClockSelection = RCC_PERIPHCLK_CSI;
  RCC_PeriphCLKInitStruct.ICSelection[RCC_IC18].ClockSelection = RCC_ICCLKSOURCE_PLL1;
  RCC_PeriphCLKInitStruct.ICSelection[RCC_IC18].ClockDivider = 40;
  ret = HAL_RCCEx_PeriphCLKConfig(&RCC_PeriphCLKInitStruct);
  if (ret)
  {
    return ret;
  }

  return ret;
}

static void SystemClock_Config(void)
{
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_PeriphCLKInitTypeDef RCC_PeriphCLKInitStruct = {0};

  /* Ensure VDDCORE=0.9V before increasing the system frequency */
  BSP_SMPS_Init(SMPS_VOLTAGE_OVERDRIVE);

  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_NONE;

  /* PLL1 = 64 x 25 / 2 = 800MHz */
  RCC_OscInitStruct.PLL1.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL1.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL1.PLLM = 2;
  RCC_OscInitStruct.PLL1.PLLN = 25;
  RCC_OscInitStruct.PLL1.PLLFractional = 0;
  RCC_OscInitStruct.PLL1.PLLP1 = 1;
  RCC_OscInitStruct.PLL1.PLLP2 = 1;

  /* PLL2 = 64 x 125 / 8 = 1000MHz */
  RCC_OscInitStruct.PLL2.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL2.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL2.PLLM = 8;
  RCC_OscInitStruct.PLL2.PLLFractional = 0;
  RCC_OscInitStruct.PLL2.PLLN = 125;
  RCC_OscInitStruct.PLL2.PLLP1 = 1;
  RCC_OscInitStruct.PLL2.PLLP2 = 1;

  /* PLL3 = (64 x 225 / 8) / (1 * 2) = 900MHz */
  RCC_OscInitStruct.PLL3.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL3.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL3.PLLM = 8;
  RCC_OscInitStruct.PLL3.PLLN = 225;
  RCC_OscInitStruct.PLL3.PLLFractional = 0;
  RCC_OscInitStruct.PLL3.PLLP1 = 1;
  RCC_OscInitStruct.PLL3.PLLP2 = 2;

  /* PLL4 = (64 x 225 / 8) / (6 * 6) = 50 MHz */
  RCC_OscInitStruct.PLL4.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL4.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL4.PLLM = 8;
  RCC_OscInitStruct.PLL4.PLLFractional = 0;
  RCC_OscInitStruct.PLL4.PLLN = 225;
  RCC_OscInitStruct.PLL4.PLLP1 = 6;
  RCC_OscInitStruct.PLL4.PLLP2 = 6;

  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    while(1);
  }

  RCC_ClkInitStruct.ClockType = (RCC_CLOCKTYPE_CPUCLK | RCC_CLOCKTYPE_SYSCLK |
                                 RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1 |
                                 RCC_CLOCKTYPE_PCLK2 | RCC_CLOCKTYPE_PCLK4 |
                                 RCC_CLOCKTYPE_PCLK5);

  /* CPU CLock (sysa_ck) = ic1_ck = PLL1 output/ic1_divider = 800 MHz */
  RCC_ClkInitStruct.CPUCLKSource = RCC_CPUCLKSOURCE_IC1;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_IC2_IC6_IC11;
  RCC_ClkInitStruct.IC1Selection.ClockSelection = RCC_ICCLKSOURCE_PLL1;
  RCC_ClkInitStruct.IC1Selection.ClockDivider = 1;

  /* AXI Clock (sysb_ck) = ic2_ck = PLL1 output/ic2_divider = 400 MHz */
  RCC_ClkInitStruct.IC2Selection.ClockSelection = RCC_ICCLKSOURCE_PLL1;
  RCC_ClkInitStruct.IC2Selection.ClockDivider = 2;

  /* NPU Clock (sysc_ck) = ic6_ck = PLL2 output/ic6_divider = 1000 MHz */
  RCC_ClkInitStruct.IC6Selection.ClockSelection = RCC_ICCLKSOURCE_PLL2;
  RCC_ClkInitStruct.IC6Selection.ClockDivider = 1;

  /* AXISRAM3/4/5/6 Clock (sysd_ck) = ic11_ck = PLL3 output/ic11_divider = 900 MHz */
  RCC_ClkInitStruct.IC11Selection.ClockSelection = RCC_ICCLKSOURCE_PLL3;
  RCC_ClkInitStruct.IC11Selection.ClockDivider = 1;

  /* HCLK = sysb_ck / HCLK divider = 200 MHz */
  RCC_ClkInitStruct.AHBCLKDivider = RCC_HCLK_DIV2;

  /* PCLKx = HCLK / PCLKx divider = 200 MHz */
  RCC_ClkInitStruct.APB1CLKDivider = RCC_APB1_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_APB2_DIV1;
  RCC_ClkInitStruct.APB4CLKDivider = RCC_APB4_DIV1;
  RCC_ClkInitStruct.APB5CLKDivider = RCC_APB5_DIV1;

